9zigen/NRF52_PhSensor/ble_services.c
/* nrf_sdh state observer. */
NRF_SDH_STATE_OBSERVER(m_buttonless_dfu_state_obs, 0) =
    {
        .handler = buttonless_dfu_sdh_state_observer,
    };

static void advertising_config_get(ble_adv_modes_config_t * p_config)
{
  memset(p_config, 0, sizeof(ble_adv_modes_config_t));

  p_config->ble_adv_fast_enabled  = true;
  p_config->ble_adv_fast_interval = APP_ADV_INTERVAL;
  p_config->ble_adv_fast_timeout  = APP_ADV_DURATION;
}


static void disconnect(uint16_t conn_handle, void * p_context)
{
  UNUSED_PARAMETER(p_context);

  ret_code_t err_code = sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
  if (err_code != NRF_SUCCESS)
  {
    NRF_LOG_WARNING("Failed to disconnect connection. Connection handle: %d Error: %d", conn_handle, err_code);
  }
  else
  {
    NRF_LOG_DEBUG("Disconnected connection handle %d", conn_handle);
  }
}


/* DFU event handler */
static void ble_dfu_buttonless_evt_handler(ble_dfu_buttonless_evt_type_t event)
{
  switch (event)
  {
    case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE:
    {
      NRF_LOG_INFO("Device is preparing to enter bootloader mode.");

      // Prevent device from advertising on disconnect.
      ble_adv_modes_config_t config;
      advertising_config_get(&config);
      config.ble_adv_on_disconnect_disabled = true;
      ble_advertising_modes_config_set(&m_advertising, &config);

      // Disconnect all other bonded devices that currently are connected.
      // This is required to receive a service changed indication
      // on bootup after a successful (or aborted) Device Firmware Update.
      uint32_t conn_count = ble_conn_state_for_each_connected(disconnect, NULL);
      NRF_LOG_INFO("Disconnected %d links.", conn_count);
      break;
    }

    case BLE_DFU_EVT_BOOTLOADER_ENTER:
      // YOUR_JOB: Write app-specific unwritten data to FLASH, control finalization of this
      //           by delaying reset by reporting false in app_shutdown_handler
      NRF_LOG_INFO("Device will enter bootloader mode.");
      break;

    case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
      NRF_LOG_ERROR("Request to enter bootloader mode failed asynchroneously.");
      // YOUR_JOB: Take corrective measures to resolve the issue
      //           like calling APP_ERROR_CHECK to reset the device.
      break;

    case BLE_DFU_EVT_RESPONSE_SEND_ERROR:
      NRF_LOG_ERROR("Request to send a response to client failed.");
      // YOUR_JOB: Take corrective measures to resolve the issue
      //           like calling APP_ERROR_CHECK to reset the device.
      APP_ERROR_CHECK(false);
      break;

    default:
      NRF_LOG_ERROR("Unknown event from ble_dfu_buttonless.");
      break;
  }
}

/* Function for handling Peer Manager events. */
void pm_evt_handler(pm_evt_t const * p_evt)
{
  pm_handler_on_pm_evt(p_evt);
  pm_handler_disconnect_on_sec_failure(p_evt);
  pm_handler_flash_clean(p_evt);

  ret_code_t     err_code;

  switch (p_evt->evt_id)
  {
    case PM_EVT_CONN_SEC_SUCCEEDED:
    {
      pm_conn_sec_status_t conn_sec_status;

      // Check if the link is authenticated (meaning at least MITM).
      err_code = pm_conn_sec_status_get(p_evt->conn_handle, &conn_sec_status);
      APP_ERROR_CHECK(err_code);

      if (conn_sec_status.mitm_protected)
      {
        NRF_LOG_INFO("Link secured. Role: %d. conn_handle: %d, Procedure: %d",
                     ble_conn_state_role(p_evt->conn_handle),
                     p_evt->conn_handle,
                     p_evt->params.conn_sec_succeeded.procedure);
      }
      else
      {
        // The peer did not use MITM, disconnect.
        NRF_LOG_INFO("Collector did not use MITM, disconnecting");
        err_code = pm_peer_id_get(m_conn_handle, &m_peer_to_be_deleted);
        APP_ERROR_CHECK(err_code);
        err_code = sd_ble_gap_disconnect(m_conn_handle,
                                         BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
      }
    } break;

    case PM_EVT_CONN_SEC_FAILED:
      m_conn_handle = BLE_CONN_HANDLE_INVALID;
      break;

    case PM_EVT_PEERS_DELETE_SUCCEEDED:
      advertising_start();
      break;

    default:
      break;
  }
}

/* Function for handling the Battery Service events. */
static void on_bas_evt(ble_bas_t * p_bas, ble_bas_evt_t * p_evt)
{
  switch (p_evt->evt_type)
  {
    case BLE_BAS_EVT_NOTIFICATION_ENABLED:
      update_sensor_characteristic_start(BATTERY_SENSOR);
      break;

    case BLE_BAS_EVT_NOTIFICATION_DISABLED:
      update_sensor_characteristic_stop(BATTERY_SENSOR);
      break;

    default:
      // No implementation needed.
      break;
  }
}


/* Function for initializing the Battery Service. */
static void bas_init(void)
{
  ret_code_t     err_code;
  ble_bas_init_t bas_init_obj;

  memset(&bas_init_obj, 0, sizeof(bas_init_obj));

  bas_init_obj.evt_handler          = on_bas_evt;
  bas_init_obj.support_notification = true;
  bas_init_obj.p_report_ref         = NULL;
  bas_init_obj.initial_batt_level   = 100;

  bas_init_obj.bl_rd_sec        = SEC_OPEN;
  bas_init_obj.bl_cccd_wr_sec   = SEC_OPEN;
  bas_init_obj.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_bas_init(&m_bas, &bas_init_obj);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
void gap_params_init(void)
{
  ret_code_t              err_code;
  ble_gap_conn_params_t   gap_conn_params;
  ble_gap_conn_sec_mode_t sec_mode;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

  err_code = sd_ble_gap_device_name_set(&sec_mode,
                                        (const uint8_t *)DEVICE_NAME,
                                        strlen(DEVICE_NAME));
  APP_ERROR_CHECK(err_code);

  /* YOUR_JOB: Use an appearance value matching the application's use case.
     err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
     APP_ERROR_CHECK(err_code); */

  memset(&gap_conn_params, 0, sizeof(gap_conn_params));

  gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
  gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
  gap_conn_params.slave_latency     = SLAVE_LATENCY;
  gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

  err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
  APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
void gatt_init(void)
{
  ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
  APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
void nrf_qwr_error_handler(uint32_t nrf_error)
{
  APP_ERROR_HANDLER(nrf_error);
}

static void on_cus_evt(ble_cus_t * p_bas, ble_cus_evt_t * p_evt)
{
  NRF_LOG_INFO("CUS Event Handler, event type %d\r\n", p_evt->evt_type);

  switch(p_evt->evt_type)
  {
    case BLE_CUS_EVT_TEMPERATURE_NOTIFICATION_ENABLED:
      update_sensor_characteristic_start(TEMPERATURE_SENSOR);
      break;

