9zigen/NRF52_PhSensor/ble_services.c
  NRF_LOG_INFO("Erase bonds!");

  err_code = pm_peers_delete();
  APP_ERROR_CHECK(err_code);

}


/* Advertising  data format */

/* Function for initializing the Advertising functionality. */
void advertising_init(void)
{
  ret_code_t             err_code;
  ble_advertising_init_t init;

  memset(&init, 0, sizeof(init));

  ble_advdata_manuf_data_t manuf_data; //Variable to hold manufacturer specific data

  /* Our data to advertise */

  /* Data Format
   * bat_%      (8bit) ->
   * temp_x100 (16bit) ->
   * ph_x100   (16bit) ->
   * ph_raw    (16bit) ->
   * */

  u16_to_u8_t temperature;
  temperature.u16                     = (uint16_t ) (get_ntc_temperature()*100);

  u16_to_u8_t ph;
  ph.u16                              = (uint16_t ) (get_ph_value()*100);

  u16_to_u8_t ph_raw;
  ph_raw.u16                          = (uint16_t ) (get_ph_raw_value());

  NRF_LOG_INFO("Temp x100 %d", temperature.u16 );
  NRF_LOG_INFO("PH   x100 %d", ph.u16);
  NRF_LOG_INFO("PH   RAW  %d", ph_raw.u16);

  uint8_t data[7];

  /* bat */
  data[0]                             = get_battery_capacity();

  /* temp */
  data[1]                             = temperature.u8[0];
  data[2]                             = temperature.u8[1];

  /* ph */
  data[3]                             = ph.u8[0];
  data[4]                             = ph.u8[1];

  /* ph raw */
  data[5]                             = ph_raw.u8[0];
  data[6]                             = ph_raw.u8[1];

  manuf_data.company_identifier       = 0xffff; //You company ID
  manuf_data.data.p_data              = data;
  manuf_data.data.size                = sizeof(data);
  init.srdata.p_manuf_specific_data   = &manuf_data;

  init.advdata.name_type              = BLE_ADVDATA_FULL_NAME;
  init.advdata.include_appearance     = true;
  init.advdata.flags                  = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

  init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
  init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

  init.config.ble_adv_fast_enabled    = true;
  init.config.ble_adv_fast_interval   = APP_ADV_INTERVAL;
  init.config.ble_adv_fast_timeout    = APP_ADV_DURATION;
  init.config.ble_adv_slow_enabled    = true;
  init.config.ble_adv_slow_interval   = APP_ADV_SLOW_INTERVAL;
  init.config.ble_adv_slow_timeout    = APP_ADV_SLOW_DURATION;

  init.evt_handler = on_adv_evt;

  err_code = ble_advertising_init(&m_advertising, &init);
  APP_ERROR_CHECK(err_code);

  ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
  APP_ERROR_CHECK(err_code);
}

/* Function for update manufacturer data */
void adv_manuf_data_update()
{

  u16_to_u8_t temperature;
  temperature.u16                     = (uint16_t ) (get_ntc_temperature()*100);

  u16_to_u8_t ph;
  ph.u16                              = (uint16_t ) (get_ph_value()*100);

  u16_to_u8_t ph_raw;
  ph_raw.u16                          = (uint16_t ) (get_ph_raw_value());


  /* bat */
  manuf_data_array[0] = get_battery_capacity();

  /* temp */
  manuf_data_array[1] = temperature.u8[0];
  manuf_data_array[2] = temperature.u8[1];

  /* ph */
  manuf_data_array[3] = ph.u8[0];
  manuf_data_array[4] = ph.u8[1];

  /* ph raw */
  manuf_data_array[5] = ph_raw.u8[0];
  manuf_data_array[6] = ph_raw.u8[1];

}

/* Function to change Advertising data */
void advertising_update()
{
  ret_code_t ret_code;

  static ble_advdata_t new_srdata;

  /* Update "manuf_data_array" */
  adv_manuf_data_update();

  /* Update manufacturer specific data */
  /* new sensors values */
  ble_advdata_manuf_data_t manuf_data;

  manuf_data.company_identifier       = 0xffff; //You company ID
  manuf_data.data.p_data              = manuf_data_array;
  manuf_data.data.size                = sizeof(manuf_data_array);
  new_srdata.p_manuf_specific_data    = &manuf_data;

  /* UUIDs */
  new_srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
  new_srdata.uuids_complete.p_uuids  = m_adv_uuids;

  ret_code = ble_advertising_advdata_update(&m_advertising, NULL, &new_srdata);
  APP_ERROR_CHECK(ret_code);

  led_indication_set(LED_INDICATE_ADVERTISING_SLOW);
}

/* Function for starting advertising. */
void advertising_start()
{
  ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
  APP_ERROR_CHECK(err_code);
}

/* Function for update sensor data char. */
void update_sensors_service(sensor_t sensor_id)
{
  ret_code_t err_code;

  uint8_t battery_level = get_battery_capacity();
  uint16_t temperature  = (uint16_t ) (get_ntc_temperature()*100);
  uint16_t ph           = (uint16_t ) (get_ph_value()*100);
  uint16_t ph_raw       = (uint16_t ) (get_ph_raw_value());

  NRF_LOG_INFO("Temp x100 %d", temperature);
  NRF_LOG_INFO("PH   x100 %d", ph);
  NRF_LOG_INFO("PH   RAW  %d", ph_raw);


  switch (sensor_id)
  {
    case BATTERY_SENSOR:
      err_code = ble_bas_battery_level_update(&m_bas, battery_level, BLE_CONN_HANDLE_ALL);
      break;

    case TEMPERATURE_SENSOR:
      err_code = ble_cus_temperature_update(&ble_cus, temperature);
      APP_ERROR_CHECK(err_code);
      break;

    case PH_SENSOR:
      err_code = ble_cus_ph_update(&ble_cus, ph);
      APP_ERROR_CHECK(err_code);

      err_code = ble_cus_ph_raw_update(&ble_cus, ph_raw);
      APP_ERROR_CHECK(err_code);
      break;

  }

}

/* Function for init ble. */
void init_ble()
{
  ble_stack_init();
  gap_params_init();
  gatt_init();
  services_init();
  advertising_init();
  conn_params_init();
  peer_manager_init();
  advertising_start();
}